import random

class Menu:
    def __init__(self):
        self.food = [{'Толчёнка':100, 'Щи':110, 'Борщ':120},
                           {'Пельмени':130, 'Плов':140, 'Блины':150},
                           {'Оливье':200, 'Шашлык':180, 'Котлеты по-киевски':170, 'Сельдь под шубой':160},
                           {'Сашими':180, 'Темпура':220, 'Суши':230},
                           {'Удон':240,'Мисо-суп':250,  'Терияки':250},
                           {'Такосяки':250,  'Роллы':260, 'Окура-магомо':260, 'Рамен':300},
                           {'Пицца':380, 'Паста':340, 'Лазанья':320},
                           {'Ризотто':340, 'Оссобуко':440, 'Панцанелла':400},
                           {'Минестроне':420, 'Тирамису':440, 'Капрезе':500, 'Равиоли':360}]
    def takeorder(self,player):
        a = random.randint(a=1, b=player.lvl) - 1
        dish = random.choice(list(self.food[a].keys()))
        price = self.food[a][dish]
        return[dish, price]

